# Example: https://lincolnmullen.com/blog/setting-up-a-new-mac-with-homebrew/

# cat cli tool alternative. https://formulae.brew.sh/formula/bat
brew "bat"

# see go processes on system. https://github.com/google/gops
# brew "gops"

# https://github.com/romkatv/powerlevel10k
tap "romkatv/powerlevel10k"
brew "romkatv/powerlevel10k/powerlevel10k"

# https://github.com/ryanoasis/nerd-fonts#option-4-homebrew-fonts
tap "homebrew/cask-fonts"
cask "font-hack-nerd-font"

# https://k9scli.io/topics/install/
brew "k9s"

# https://www.warp.dev/ requires account creation
#cask "warp"
# spotlight alternative. https://www.alfredapp.com/
cask "alfred"
# snap windows. https://rectangleapp.com/
cask "rectangle"
# password managers
cask "bitwarden"
cask "keepassxc"
cask "1password"
# enable mouse scroll differently than trackpad. https://mousefix.org/
# update: Logitech has an OOTB solution
# alternatives: https://github.com/ther0n/UnnaturalScrollWheels, https://pilotmoon.com/scrollreverser/
# cask "mouse-fix"
# enable a calendar in menu bar. https://www.mowglii.com/itsycal/
cask "itsycal"
# view timezones in menu bar. https://github.com/n0shake/clocker
# cask "clocker"
# screenshot/markup alternative. https://flameshot.org/brew
# cask "flameshot"
# properly uninstall software. https://freemacsoft.net/appcleaner/. 
# Maybe not necessary if you can just brew uninstall.
cask "appcleaner"
# clipboard manager. https://maccy.app/
cask "maccy"
# window manager. https://alt-tab-macos.netlify.app/
cask "alt-tab"
# menubar hider
# https://github.com/dwarvesf/hidden doesn't handle the notch well; apps that overflow into the notch are not visible
# If you have too many menu bar items, not everything shows up. Use this to collapse things you can't hide by default.
# cask "hiddenbar"
cask "bartender"
# text expansion. for simple text replacement, use the keyboard text replacement feature on macos.
# cask "espanso"
# diff tool
cask "meld"
